Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_DCDC.h
/*
** ###################################################################
**     Processors:          MIMXRT1151DHM8B
**                          MIMXRT1151DVM8B
**                          MIMXRT1151XHM8B
**                          MIMXRT1151XVM8B
**                          MIMXRT1152AHM6B
**                          MIMXRT1152AVM6B
**                          MIMXRT1152DHM8B
**                          MIMXRT1152DVM8B
**                          MIMXRT1152XHM8B
**                          MIMXRT1152XVM8B
**
**     Version:             rev. 0.2, 2026-02-26
**     Build:               b260622
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DCDC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2026-01-09)
**         Initial version.
**     - rev. 0.2 (2026-02-26)
**         Update header file based on RM Rev1.
**
** ###################################################################
*/

/*!
 * @file PERI_DCDC.h
 * @version 0.2
 * @date 2026-02-26
 * @brief CMSIS Peripheral Access Layer for DCDC
 *
 * CMSIS Peripheral Access Layer for DCDC
 */

#if !defined(PERI_DCDC_H_)
#define PERI_DCDC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1151DHM8B) || defined(CPU_MIMXRT1151DVM8B) || defined(CPU_MIMXRT1151XHM8B) || defined(CPU_MIMXRT1151XVM8B))
#include "../MIMXRT1151_COMMON.h"
#elif (defined(CPU_MIMXRT1152AHM6B) || defined(CPU_MIMXRT1152AVM6B) || defined(CPU_MIMXRT1152DHM8B) || defined(CPU_MIMXRT1152DVM8B) || defined(CPU_MIMXRT1152XHM8B) || defined(CPU_MIMXRT1152XVM8B))
#include "../MIMXRT1152_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- DCDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCDC_Peripheral_Access_Layer DCDC Peripheral Access Layer
 * @{
 */

/** DCDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL0;                             /**< DCDC Control Register 0, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< DCDC Control Register 1, offset: 0x4 */
  __IO uint32_t REG0;                              /**< DCDC Register 0, offset: 0x8 */
  __IO uint32_t REG1;                              /**< DCDC Register 1, offset: 0xC */
  __IO uint32_t REG2;                              /**< DCDC Register 2, offset: 0x10 */
  __IO uint32_t REG3;                              /**< DCDC Register 3, offset: 0x14 */
  __IO uint32_t REG4;                              /**< DCDC Register 4, offset: 0x18 */
  __IO uint32_t REG5;                              /**< DCDC Register 5, offset: 0x1C */
  __IO uint32_t REG6;                              /**< DCDC Register 6, offset: 0x20 */
  __IO uint32_t REG7;                              /**< DCDC Register 7, offset: 0x24 */
  __IO uint32_t REG7P;                             /**< DCDC Register 7 plus, offset: 0x28 */
  __IO uint32_t REG8;                              /**< DCDC Register 8, offset: 0x2C */
  __IO uint32_t REG9;                              /**< DCDC Register 9, offset: 0x30 */
  __IO uint32_t REG10;                             /**< DCDC Register 10, offset: 0x34 */
  __IO uint32_t REG11;                             /**< DCDC Register 11, offset: 0x38 */
  __IO uint32_t REG12;                             /**< DCDC Register 12, offset: 0x3C */
  __IO uint32_t REG13;                             /**< DCDC Register 13, offset: 0x40 */
  __IO uint32_t REG14;                             /**< DCDC Register 14, offset: 0x44 */
  __IO uint32_t REG15;                             /**< DCDC Register 15, offset: 0x48 */
  __IO uint32_t REG16;                             /**< DCDC Register 16, offset: 0x4C */
  __IO uint32_t REG17;                             /**< DCDC Register 17, offset: 0x50 */
  __IO uint32_t REG18;                             /**< DCDC Register 18, offset: 0x54 */
  __IO uint32_t REG19;                             /**< DCDC Register 19, offset: 0x58 */
  __IO uint32_t REG20;                             /**< DCDC Register 20, offset: 0x5C */
  __IO uint32_t REG21;                             /**< DCDC Register 21, offset: 0x60 */
  __IO uint32_t REG22;                             /**< DCDC Register 22, offset: 0x64 */
  __IO uint32_t REG23;                             /**< DCDC Register 23, offset: 0x68 */
  __IO uint32_t REG24;                             /**< DCDC Register 24, offset: 0x6C */
} DCDC_Type;

/* ----------------------------------------------------------------------------
   -- DCDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCDC_Register_Masks DCDC Register Masks
 * @{
 */

/*! @name CTRL0 - DCDC Control Register 0 */
/*! @{ */

#define DCDC_CTRL0_ENABLE_MASK                   (0x1U)
#define DCDC_CTRL0_ENABLE_SHIFT                  (0U)
/*! ENABLE
 *  0b0..Disable (Bypass)
 *  0b1..Enable
 */
#define DCDC_CTRL0_ENABLE(x)                     (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_ENABLE_SHIFT)) & DCDC_CTRL0_ENABLE_MASK)

#define DCDC_CTRL0_DIG_EN_MASK                   (0x2U)
#define DCDC_CTRL0_DIG_EN_SHIFT                  (1U)
/*! DIG_EN
 *  0b0..Reserved
 *  0b1..Enable
 */
#define DCDC_CTRL0_DIG_EN(x)                     (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_DIG_EN_SHIFT)) & DCDC_CTRL0_DIG_EN_MASK)

