Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_DCDC.h
/*! @name REG5 - DCDC Register 5 */
/*! @{ */

#define DCDC_REG5_DIG_EN_SP_MASK                 (0xFFFFU)
#define DCDC_REG5_DIG_EN_SP_SHIFT                (0U)
#define DCDC_REG5_DIG_EN_SP(x)                   (((uint32_t)(((uint32_t)(x)) << DCDC_REG5_DIG_EN_SP_SHIFT)) & DCDC_REG5_DIG_EN_SP_MASK)
/*! @} */

/*! @name REG6 - DCDC Register 6 */
/*! @{ */

#define DCDC_REG6_LP_MODE_SP_MASK                (0xFFFFU)
#define DCDC_REG6_LP_MODE_SP_SHIFT               (0U)
#define DCDC_REG6_LP_MODE_SP(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_REG6_LP_MODE_SP_SHIFT)) & DCDC_REG6_LP_MODE_SP_MASK)
/*! @} */

/*! @name REG7 - DCDC Register 7 */
/*! @{ */

#define DCDC_REG7_STBY_EN_SP_MASK                (0xFFFFU)
#define DCDC_REG7_STBY_EN_SP_SHIFT               (0U)
#define DCDC_REG7_STBY_EN_SP(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_REG7_STBY_EN_SP_SHIFT)) & DCDC_REG7_STBY_EN_SP_MASK)
/*! @} */

/*! @name REG7P - DCDC Register 7 plus */
/*! @{ */

#define DCDC_REG7P_STBY_LP_MODE_SP_MASK          (0xFFFFU)
#define DCDC_REG7P_STBY_LP_MODE_SP_SHIFT         (0U)
#define DCDC_REG7P_STBY_LP_MODE_SP(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_REG7P_STBY_LP_MODE_SP_SHIFT)) & DCDC_REG7P_STBY_LP_MODE_SP_MASK)
/*! @} */

/*! @name REG8 - DCDC Register 8 */
/*! @{ */

#define DCDC_REG8_ANA_TRG_SP0_MASK               (0xFFFFFFFFU)
#define DCDC_REG8_ANA_TRG_SP0_SHIFT              (0U)
#define DCDC_REG8_ANA_TRG_SP0(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_REG8_ANA_TRG_SP0_SHIFT)) & DCDC_REG8_ANA_TRG_SP0_MASK)
/*! @} */

/*! @name REG9 - DCDC Register 9 */
/*! @{ */

#define DCDC_REG9_ANA_TRG_SP1_MASK               (0xFFFFFFFFU)
#define DCDC_REG9_ANA_TRG_SP1_SHIFT              (0U)
#define DCDC_REG9_ANA_TRG_SP1(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_REG9_ANA_TRG_SP1_SHIFT)) & DCDC_REG9_ANA_TRG_SP1_MASK)
/*! @} */

/*! @name REG10 - DCDC Register 10 */
/*! @{ */

#define DCDC_REG10_ANA_TRG_SP2_MASK              (0xFFFFFFFFU)
#define DCDC_REG10_ANA_TRG_SP2_SHIFT             (0U)
#define DCDC_REG10_ANA_TRG_SP2(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG10_ANA_TRG_SP2_SHIFT)) & DCDC_REG10_ANA_TRG_SP2_MASK)
/*! @} */

/*! @name REG11 - DCDC Register 11 */
/*! @{ */

#define DCDC_REG11_ANA_TRG_SP3_MASK              (0xFFFFFFFFU)
#define DCDC_REG11_ANA_TRG_SP3_SHIFT             (0U)
#define DCDC_REG11_ANA_TRG_SP3(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG11_ANA_TRG_SP3_SHIFT)) & DCDC_REG11_ANA_TRG_SP3_MASK)
/*! @} */

/*! @name REG12 - DCDC Register 12 */
/*! @{ */

#define DCDC_REG12_DIG_TRG_SP0_MASK              (0xFFFFFFFFU)
#define DCDC_REG12_DIG_TRG_SP0_SHIFT             (0U)
#define DCDC_REG12_DIG_TRG_SP0(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG12_DIG_TRG_SP0_SHIFT)) & DCDC_REG12_DIG_TRG_SP0_MASK)
/*! @} */

/*! @name REG13 - DCDC Register 13 */
/*! @{ */

#define DCDC_REG13_DIG_TRG_SP1_MASK              (0xFFFFFFFFU)
#define DCDC_REG13_DIG_TRG_SP1_SHIFT             (0U)
#define DCDC_REG13_DIG_TRG_SP1(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG13_DIG_TRG_SP1_SHIFT)) & DCDC_REG13_DIG_TRG_SP1_MASK)
/*! @} */

/*! @name REG14 - DCDC Register 14 */
/*! @{ */

#define DCDC_REG14_DIG_TRG_SP2_MASK              (0xFFFFFFFFU)
#define DCDC_REG14_DIG_TRG_SP2_SHIFT             (0U)
#define DCDC_REG14_DIG_TRG_SP2(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG14_DIG_TRG_SP2_SHIFT)) & DCDC_REG14_DIG_TRG_SP2_MASK)
/*! @} */

/*! @name REG15 - DCDC Register 15 */
/*! @{ */

#define DCDC_REG15_DIG_TRG_SP3_MASK              (0xFFFFFFFFU)
#define DCDC_REG15_DIG_TRG_SP3_SHIFT             (0U)
#define DCDC_REG15_DIG_TRG_SP3(x)                (((uint32_t)(((uint32_t)(x)) << DCDC_REG15_DIG_TRG_SP3_SHIFT)) & DCDC_REG15_DIG_TRG_SP3_MASK)
/*! @} */

/*! @name REG16 - DCDC Register 16 */
/*! @{ */

#define DCDC_REG16_ANA_STBY_TRG_SP0_MASK         (0xFFFFFFFFU)
#define DCDC_REG16_ANA_STBY_TRG_SP0_SHIFT        (0U)
#define DCDC_REG16_ANA_STBY_TRG_SP0(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG16_ANA_STBY_TRG_SP0_SHIFT)) & DCDC_REG16_ANA_STBY_TRG_SP0_MASK)
/*! @} */

/*! @name REG17 - DCDC Register 17 */
/*! @{ */

#define DCDC_REG17_ANA_STBY_TRG_SP1_MASK         (0xFFFFFFFFU)
#define DCDC_REG17_ANA_STBY_TRG_SP1_SHIFT        (0U)
#define DCDC_REG17_ANA_STBY_TRG_SP1(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG17_ANA_STBY_TRG_SP1_SHIFT)) & DCDC_REG17_ANA_STBY_TRG_SP1_MASK)
/*! @} */

/*! @name REG18 - DCDC Register 18 */
/*! @{ */

#define DCDC_REG18_ANA_STBY_TRG_SP2_MASK         (0xFFFFFFFFU)
#define DCDC_REG18_ANA_STBY_TRG_SP2_SHIFT        (0U)
#define DCDC_REG18_ANA_STBY_TRG_SP2(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG18_ANA_STBY_TRG_SP2_SHIFT)) & DCDC_REG18_ANA_STBY_TRG_SP2_MASK)
/*! @} */

/*! @name REG19 - DCDC Register 19 */
/*! @{ */

#define DCDC_REG19_ANA_STBY_TRG_SP3_MASK         (0xFFFFFFFFU)
#define DCDC_REG19_ANA_STBY_TRG_SP3_SHIFT        (0U)
#define DCDC_REG19_ANA_STBY_TRG_SP3(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG19_ANA_STBY_TRG_SP3_SHIFT)) & DCDC_REG19_ANA_STBY_TRG_SP3_MASK)
/*! @} */

/*! @name REG20 - DCDC Register 20 */
/*! @{ */

#define DCDC_REG20_DIG_STBY_TRG_SP0_MASK         (0xFFFFFFFFU)
#define DCDC_REG20_DIG_STBY_TRG_SP0_SHIFT        (0U)
#define DCDC_REG20_DIG_STBY_TRG_SP0(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG20_DIG_STBY_TRG_SP0_SHIFT)) & DCDC_REG20_DIG_STBY_TRG_SP0_MASK)
/*! @} */

/*! @name REG21 - DCDC Register 21 */
/*! @{ */

#define DCDC_REG21_DIG_STBY_TRG_SP1_MASK         (0xFFFFFFFFU)
#define DCDC_REG21_DIG_STBY_TRG_SP1_SHIFT        (0U)
#define DCDC_REG21_DIG_STBY_TRG_SP1(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG21_DIG_STBY_TRG_SP1_SHIFT)) & DCDC_REG21_DIG_STBY_TRG_SP1_MASK)
/*! @} */

/*! @name REG22 - DCDC Register 22 */
/*! @{ */

#define DCDC_REG22_DIG_STBY_TRG_SP2_MASK         (0xFFFFFFFFU)
#define DCDC_REG22_DIG_STBY_TRG_SP2_SHIFT        (0U)
#define DCDC_REG22_DIG_STBY_TRG_SP2(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG22_DIG_STBY_TRG_SP2_SHIFT)) & DCDC_REG22_DIG_STBY_TRG_SP2_MASK)
/*! @} */

/*! @name REG23 - DCDC Register 23 */
/*! @{ */

#define DCDC_REG23_DIG_STBY_TRG_SP3_MASK         (0xFFFFFFFFU)
#define DCDC_REG23_DIG_STBY_TRG_SP3_SHIFT        (0U)
#define DCDC_REG23_DIG_STBY_TRG_SP3(x)           (((uint32_t)(((uint32_t)(x)) << DCDC_REG23_DIG_STBY_TRG_SP3_SHIFT)) & DCDC_REG23_DIG_STBY_TRG_SP3_MASK)
/*! @} */

/*! @name REG24 - DCDC Register 24 */
/*! @{ */

#define DCDC_REG24_OK_COUNT_MASK                 (0xFFFFFFFFU)
#define DCDC_REG24_OK_COUNT_SHIFT                (0U)
#define DCDC_REG24_OK_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << DCDC_REG24_OK_COUNT_SHIFT)) & DCDC_REG24_OK_COUNT_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group DCDC_Register_Masks */


/*!
 * @}
 */ /* end of group DCDC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_DCDC_H_ */

